Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettingsWarn Property
 SunAndShadowSettings cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopySunAndShadowSettingsWarn { get; }
Public Shared ReadOnly Property CannotCopySunAndShadowSettingsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopySunAndShadowSettingsWarn {
	FailureDefinitionId^ get ();
}
static member CannotCopySunAndShadowSettingsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace